let cardTheme = [
	Adventure: {
		Theme image: "images/icons/Adventure_icon.png",
		Theme color: 'Blue',
		Theme decription: "Тема \"Приключения\" первая доступная тема карт в игре и, таким образом, единственная тема, которую не нужно разблокировать, поднимаясь в ранге \"новичка\". Основной упор сделан на нанесении максимального урона, как одной цели, так и большому количеству юнитов противника, в ней доступно большое количество магии и различных юнитов. Одна из самых мощных игровых колод.",
		Cards: [
			{
				Card name: "Покахонтас Рэнди",
				Character: "Рэнди Марш",
				Card image: "images/cards/Adventure/Randy_adv_card.png",
				Class: "Fighter",
				Rarities: 'Epic',
				Card description: "Класс бойца с сильным уроном и быстрой атакой дает ему преимущество над классом убийц в стычке один на один. Стоит поместить его на карте так, чтобы он успел призвать хотя бы одного юнита для небольшого перевеса в нападении, чем лучше его защищать, тем больше юнитов можно получить на поле битвы",
			 	Ability: "Призывает в бой индейского ребенка",
			 	Effect: true,
			 	Warcry: false,
			 	Energy Cost: "5",
			 	Health: "Начальный уровень 400",
			 	Attack: "Начальный уровень 60" ,
			 	Range: "0.8",
			 	Radius: ,
			 	Charge time: "13 секунд",
			 	Time: , 
			 	Units: true,
			}
		]
	},
	SciFi: {
		Theme image: "images/icons/Scifi_icon.png",
		Theme color: 'Orange',
		Theme decription: "Тема \"Научная фантастика\" - ддя удобства \"НФ\", фокусируется на управлении полем битвы с помощью различных эффектов, влияющих на противника, таких как «Яд», «Замораживание» или «Контроль над разумом». Это вторая тема в игре и разблокируется, когда твой \"новичек\" дойдет до 5-м уровня.",
		Cards: [
			{
				Card name: "Шестой элемент Рэнди",
				Character: "Рэнди Марш",
				Card image: ,
				Class: "Fighter",
				Rarities: 'Legendary',
				Card description: "Класс бойца с достточно сильным уроном , но не быстрой атакой. Имеет преимущество над убийцами в стычке один на один. Юниты не настолько сильны, как у Покахонтас или Монашки",
			 	Ability: "Заряжается: блюет и вызывает робот пылесос",
			 	Effect: true,
			 	Warcry: false,
			 	Energy Cost: "5",
			 	Health: "Начальный уровень 500",
			 	Attack: "Начальный уровень 75" ,
			 	Range: "0.8",
			 	Radius: ,
			 	Charge time: "13 секунд",
			 	Time: , 
			 	Units: true,
			}
		]
	},
// 	Neutral: {
//		Theme image: img/,
//		Theme color: 'Gray',
// 		Theme description: "Нейтральная тема состоит из различных наемников с различными способностями, которые не связаны ни с какой основной темой (за исключением Мистера Гаррисона). Это позволяет добавлять их в любую колоду независимо от сочетания тем. Как и в теме \"Приключения\", большинство нейтральных карт доступно с самого начала игры."
//	},
//	Mystery: {
//		Theme image: img/,
//		Theme color: 'Green',
// 		Theme description: "Мистическая тема пригодится для затяжных боев за счет упора на магию исцеления и небольшого преимущества в манипулировании энергией. Это третья тема в игре, разблокируется, когда ты достигнешь 10-го уровня."
//	},
//	Fantasy: {
//		Theme image: img/,
//		Theme color: 'Violet',
// 		Theme description: "Тема \"Фэнтези\" фокусируется на управлении битвой с помощью мощных карточных эффектов, таких как непробиваемый щит, превращения и, среди прочего, обезвреживание врагов, путем уменьшения уровня атаки и уменьшения общего колличества жизни юнита. Это четвертая тема в игре, разблокируется при достичжении игроком (новичком) 15 уровня. Тема имеет большое колличество отсылок к сериям вселенной Сауз Парка, а ее персонажи встречаются довольно часто на экранах."
//	},
//	Superheroes: {
//		Theme image: img/,
//		Theme color: 'Orange',
// 		Theme description: "Тема \"Супергерои\" является пятой темой в игре и была выпущена 15 июля 2019 года. Имеет отсылку к сериям 13 и 14 сезона, где впервые появляется таинственный супергерой, который защищает Сауз Парк от преступности. Енот и его Команда, а также другие загадочные супергерои готовы вступить в противостояние с любым злом."
//	}
];


//CardsClass:  'Fighter', 'Killer', 'Tank', 'Ranged', 'Spell', 'Totem', 'Trap'
//CardsRarities: 'Common', 'Rare', 'Epic', 'Legendary'
